FI/Ajanvaraustiedot/Integraatiopalvelu_Ajanvaraustiedot_Esimerkkisanoma_GetQueueData_Request_3.1.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:lif="Lifecare.Integration.ScheduleDataService" xmlns:lif1="Lifecare.Integration.Common.Contracts" xmlns:lif2="Lifecare.Integration.ScheduleDataService.Contracts" xmlns:arr="http://schemas.microsoft.com/2003/10/Serialization/Arrays">
   <soapenv:Header/>
   <soapenv:Body>
      <lif:GetQueueDataRequest>
         <lif:MessageHeader>
               <lif1:MessageID>?</lif1:MessageID>
               <lif1:TransactionID>?</lif1:TransactionID>
               <lif1:SenderID>?</lif1:SenderID>
               <lif1:SenderApplication>?</lif1:SenderApplication>
               <lif1:ReceiverID>?</lif1:ReceiverID>
               <lif1:ReceiverApplication>?</lif1:ReceiverApplication>
               <lif1:CharacterSet>?</lif1:CharacterSet>
               <lif1:DataServiceURL>?</lif1:DataServiceURL>
               <lif1:UserLanguageCode>?</lif1:UserLanguageCode>
               <lif1:VersionNumber>?</lif1:VersionNumber>
         </lif:MessageHeader>
         <lif:Common>
               <lif1:ContractKey>aaaabbbbbcccccc</lif1:ContractKey>
               <lif1:CallingSystem>Keksi</lif1:CallingSystem>
               <lif1:Area>
                  <lif1:CodeSetName>?</lif1:CodeSetName>
                  <lif1:CodeSetId>?</lif1:CodeSetId>
                  <lif1:CodeValue>?</lif1:CodeValue>
                  <lif1:CodeDescription>?</lif1:CodeDescription>
               </lif1:Area>
               <lif1:UserIdentifiers>
                  <lif1:UserIdentifier>
                     <lif1:UserIdentifierCodeId>EFFICA_USER_ID</lif1:UserIdentifierCodeId>
                     <lif1:UserIdentifierCode>tieto</lif1:UserIdentifierCode>
                     <lif1:FamilyName>?</lif1:FamilyName>
                     <lif1:GivenNames>?</lif1:GivenNames>
                     <lif1:Profession>?</lif1:Profession>
                  </lif1:UserIdentifier>
               </lif1:UserIdentifiers>
               <lif1:Function>
                  <lif1:CodeSetName>?</lif1:CodeSetName>
                  <lif1:CodeSetId>?</lif1:CodeSetId>
                  <lif1:CodeValue>?</lif1:CodeValue>
                  <lif1:CodeDescription>?</lif1:CodeDescription>
               </lif1:Function>
               <lif1:ReasonCode>
                  <lif1:CodeSetName>?</lif1:CodeSetName>
                  <lif1:CodeSetId>?</lif1:CodeSetId>
                  <lif1:CodeValue>?</lif1:CodeValue>
                  <lif1:CodeDescription>?</lif1:CodeDescription>
               </lif1:ReasonCode>
         </lif:Common>
         <lif:QueueReq>
            <lif2:RequestType>InsUpd</lif2:RequestType>
            <lif2:Speciality>
               <lif1:CodeSetName>?</lif1:CodeSetName>
               <lif1:CodeSetId>?</lif1:CodeSetId>
               <lif1:CodeValue></lif1:CodeValue>
               <lif1:CodeDescription>?</lif1:CodeDescription>
            </lif2:Speciality>
            <lif2:QueueCodes>
               <lif1:Code>
                  <lif1:CodeSetName>?</lif1:CodeSetName>
                  <lif1:CodeSetId>?</lif1:CodeSetId>
                  <lif1:CodeValue>KI/LONKKA</lif1:CodeValue>
                  <lif1:CodeDescription>?</lif1:CodeDescription>
               </lif1:Code>
               <lif1:Code>
                  <lif1:CodeSetName>?</lif1:CodeSetName>
                  <lif1:CodeSetId>?</lif1:CodeSetId>
                  <lif1:CodeValue>KI/POLVI</lif1:CodeValue>
                  <lif1:CodeDescription>?</lif1:CodeDescription>
               </lif1:Code>
            </lif2:QueueCodes>
            <lif2:QueueType>
               <lif1:CodeSetName>?</lif1:CodeSetName>
               <lif1:CodeSetId>?</lif1:CodeSetId>
               <lif1:CodeValue>H</lif1:CodeValue>
               <lif1:CodeDescription>?</lif1:CodeDescription>
            </lif2:QueueType>
            <lif2:AppointmentType>
               <lif1:CodeSetName>?</lif1:CodeSetName>
               <lif1:CodeSetId>?</lif1:CodeSetId>
               <lif1:CodeValue>LEIK</lif1:CodeValue>
               <lif1:CodeDescription>?</lif1:CodeDescription>
            </lif2:AppointmentType>
            <lif2:Operations>
            </lif2:Operations>
            <lif2:StartDateTime>2015-03-13T12:00:00</lif2:StartDateTime>
         </lif:QueueReq>
      </lif:GetQueueDataRequest>
   </soapenv:Body>
</soapenv:Envelope>